#include<iostream>
#include "TQueuelist.h"
#include "Tstacklist.h"

int main() {
	setlocale(LC_ALL, "russian");
	cout << "****************************************************\n";
	cout << "\tТЕСТИРОВАНИЕ ОЧЕРЕДИ \n";
	cout << "****************************************************\n\n\n";
	TQueuelist<int> a;
	cout << "\tПроверка Очереди А на пустоту (1-Совпадают, 0 - не совпадают):\n"; cout << a.IsEmpty() << "\n";

	cout << "\n";

	cout << "\tДобавление элементов в очередь А: ";
	for (int i = 0; i < 10; i++) 
	{
		a.push(i + 1);
		cout << a.getlast() << " ";
	}
	cout << "\n";
	cout << "\n\tПроверка Очереди А на пустоту :(1 - Совпадают, 0 - не совпадают):\n"; cout << a.IsEmpty() << "\n";
	cout << "\n";

	cout << "\tКопирование Очереди А в Очередь В\n";

	TQueuelist<int> b;

	b = a;

	cout << "\n\tПроверка Очередей на совпадение: ";
	if (b == a) 
	{
		cout << "ДА(совпадают)\n";
	}
	else 
	{
		cout << "НЕТ(не совпадают)\n";
	}
	cout << "\n";
	cout << "Методы:\nB.pop();\nB.push(39);\n\n";
	b.pop();
	b.push(39);

	cout << "\tПроверка Очередей на совпадение: ";
	if (b == a) 
	{
		cout << "ДА(совпадают)\n";
	}
	else {
		cout << "НЕТ(не совпадают)\n";
	}
	cout << "\n";

	cout << "\tОчистка Очереди B:(Печать первого и последнего элементов Очереди)\n";
	for (int i = 0; i < 10; i++) 
	{
		cout << " Первый эл-нт: "<<b.getfirst() << "  Последний эл-нт:" << b.getlast() << " ";
		cout << "\n";
		b.pop();
	}
	
	cout << "****************************************************\n";
	cout << "\t ТЕСТИРОВАНИЕ СТЕКА (тестирование очереди см выше!)\n";
	cout << "****************************************************\n";
	Tstacklist<int> A;
	
	cout << "\n\tПроверка Стека A(1 - Совпадают, 0 - не совпадают)" << endl << A.IsEmpty() << "\n";
	cout << "\n";
	cout << "\tДобавление элементов в Стек А:";
	for (int i = 0; i < 10; i++) 
	{
		A.push(i +1);
		cout << A.top() << " ";
	}
	cout << "\n";
	cout << "\n\tПроверка Стека на пустоту A(1 - Совпадают, 0 - не совпадают)" << endl << A.IsEmpty() << "\n";
	cout << "\n";
	cout << "\tКопирование Стека А в Стек В:\n";
	Tstacklist<int> B;

	B = A;

	cout << "\n\tПроверка Стеков на совпадение: ";
	if (B == A) 
	{
		cout << "ДА\n";
	}
	else 
	{
		cout << "НЕТ\n";
	}
	cout << "\n";
	cout << "Методы: \nB.pop();\nB.push(7);\n\n";
	B.pop();
	B.push(7);

	cout << "\tПроверка Стеков на совпадение: ";
	if (B == A)
	{
		cout << "Да\n";
	}
	else 
	{
		cout << "Нет\n";
	}

	cout << "\n";
	cout << "\tОчистка Стека:(Печать вершины стека): \n";
	for (int i = 0; i < 10; i++) 
	{
		cout <<"Новая вершина стека: "<< B.top() << " ";
		B.pop();
		cout << "\n";
	}
	cout << "\n(тестирование очереди см выше!)";
	cout << "\n";
	cout << "\n";
	
}